<?xml version="1.0"?>
<net name="Expand" version="11">
	<layers>
		<layer id="1" name="X" type="Parameter" version="opset1">
			<data shape="1,3,1" element_type="f32" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="f16" />
			</rt_info>
			<output>
				<port id="0" precision="FP32" names="X">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="shape" type="Parameter" version="opset1">
			<data shape="2" element_type="i64" />
			<rt_info>
				<attribute name="old_api_map_element_type" version="0" value="i32" />
			</rt_info>
			<output>
				<port id="0" precision="I64" names="shape">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Y" type="Broadcast" version="opset3">
			<data mode="bidirectional" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="Y">
					<dim>1</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Y/sink_port_0" type="Result" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>3</dim>
					<dim>-1</dim>
				</port>
			</input>
		</layer>
	</layers>
	<edges>
		<edge from-layer="0" from-port="0" to-layer="2" to-port="1" />
		<edge from-layer="1" from-port="0" to-layer="2" to-port="0" />
		<edge from-layer="2" from-port="2" to-layer="3" to-port="0" />
	</edges>
	<rt_info>
		<Runtime_version value="2023.1.0-12185-9e6b00e51cd-releases/2023/1" />
		<conversion_parameters>
			<input_model value="DIR\1.onnx" />
			<is_python_object value="False" />
		</conversion_parameters>
	</rt_info>
</net>
